---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailSegmenetRepesentation
source: html/69455db5-b46d-5996-5315-ee24fefe30ee.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailSegmenetRepesentation Property

"Representation"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailSegmenetRepesentation { get; }
```